In [2]:
!pip3 install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   --------- ------------------------------ 10.2/45.0 kB ? eta -:--:--
   ---------------------------------------- 45.0/45.0 kB 551.3 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [6]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

In [7]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [8]:
from sqlalchemy import text

Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [9]:
with engine.connect() as connection:
    query = text('SELECT * FROM rental')
    result = connection.execute(query)

result

In [10]:
def rentals_month(connection, month , year):
    with engine.connect() as connection:
        txt = f'''select * from sakila.rental
                where year(rental_date)= {year} and month(rental_date)= {month};'''
        query = text(txt)
        result = connection.execute(query)
        return pd.DataFrame(result.all())

In [11]:
df=rentals_month(connection, 5, 2005)

In [12]:
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

In [13]:
def rental_count_month(df, month, year):
    result = df.groupby('customer_id')['rental_id'].count().reset_index()
    result.rename(columns={'rental_id': f'rental_count_{month}_{year}'}, inplace =True)
    return result

In [14]:
df_2=rental_count_month(df, 6, 2005)

In [15]:
df_2

     customer_id  rental_count_6_2005
0              1                    2
1              2                    1
2              3                    2
3              5                    3
4              6                    3
..           ...                  ...
515          594                    4
516          595                    1
517          596                    6
518          597                    2
519          599                    1

[520 rows x 2 columns]

In [16]:
df_=rentals_month(connection, 6, 2005)

In [17]:
df_3=rental_count_month(df_, 5, 2006)

In [18]:
df_3

     customer_id  rental_count_5_2006
0              1                    7
1              2                    1
2              3                    4
3              4                    6
4              5                    5
..           ...                  ...
585          595                    2
586          596                    2
587          597                    3
588          598                    1
589          599                    4

[590 rows x 2 columns]

Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [19]:
def compare_rentals(df,df2):
    new_set=pd.merge(df,df2, on=['customer_id'])
    new_set['difference']=new_set.iloc[:,1]-new_set.iloc[:,2]
    return new_set

In [20]:
compare_rentals(df_2,df_3)

     customer_id  rental_count_6_2005  rental_count_5_2006  difference
0              1                    2                    7          -5
1              2                    1                    1           0
2              3                    2                    4          -2
3              5                    3                    5          -2
4              6                    3                    4          -1
..           ...                  ...                  ...         ...
507          594                    4                    6          -2
508          595                    1                    2          -1
509          596                    6                    2           4
510          597                    2                    3          -1
511          599                    1                    4          -3

[512 rows x 4 columns]

In [21]:
new_set=pd.merge(df_3,df_2, on=['customer_id'])
new_set

     customer_id  rental_count_5_2006  rental_count_6_2005
0              1                    7                    2
1              2                    1                    1
2              3                    4                    2
3              5                    5                    3
4              6                    4                    3
..           ...                  ...                  ...
507          594                    6                    4
508          595                    2                    1
509          596                    2                    6
510          597                    3                    2
511          599                    4                    1

[512 rows x 3 columns]

In [22]:
new_set['difference']=new_set["rental_count_5_2006"]-new_set["rental_count_6_2005"]

In [23]:
new_set
new_set.iloc[:,2]

0      2
1      1
2      2
3      3
4      3
      ..
507    4
508    1
509    6
510    2
511    1
Name: rental_count_6_2005, Length: 512, dtype: int64